congallenwang/shdsl-bridge/bsp/stm32f107/drivers/stm32_eth_bak.c
    /* MCO pin configuration------------------------------------------------- */
    /* Configure MCO (PA8) as alternate function push-pull */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif /* USE_MCO */
}

void rt_hw_stm32_eth_init()
{
    RCC_Configuration();
    GPIO_Configuration();
    NVIC_Configuration();

    // OUI 00-80-E1 STMICROELECTRONICS
    stm32_eth_device.dev_addr[0] = 0x00;
    stm32_eth_device.dev_addr[1] = 0x80;
    stm32_eth_device.dev_addr[2] = 0xE1;
    // generate MAC addr from 96bit unique ID (only for test)
    stm32_eth_device.dev_addr[3] = *(rt_uint8_t*)(0x1FFFF7E8+7);
    stm32_eth_device.dev_addr[4] = *(rt_uint8_t*)(0x1FFFF7E8+8);
    stm32_eth_device.dev_addr[5] = *(rt_uint8_t*)(0x1FFFF7E8+9);

    stm32_eth_device.parent.parent.init       = rt_stm32_eth_init;
    stm32_eth_device.parent.parent.open       = rt_stm32_eth_open;
    stm32_eth_device.parent.parent.close      = rt_stm32_eth_close;
    stm32_eth_device.parent.parent.read       = rt_stm32_eth_read;
    stm32_eth_device.parent.parent.write      = rt_stm32_eth_write;
    stm32_eth_device.parent.parent.control    = rt_stm32_eth_control;
    stm32_eth_device.parent.parent.user_data  = RT_NULL;

    stm32_eth_device.parent.eth_rx     = rt_stm32_eth_rx;
    stm32_eth_device.parent.eth_tx     = rt_stm32_eth_tx;

    /* init tx buffer free semaphore */
    rt_sem_init(&tx_buf_free, "tx_buf", ETH_TXBUFNB, RT_IPC_FLAG_FIFO);

    /* register eth device */
    eth_device_init(&(stm32_eth_device.parent), "e0");
}

#if 0
#ifdef RT_USING_FINSH
#include <finsh.h>
static void phy_search(void)
{
    int i;
    int value;

    for(i=0; i<32; i++)
    {
        value = ETH_ReadPHYRegister(i, 2);
        rt_kprintf("addr %02d: %04X\n", i, value);
    }
}
FINSH_FUNCTION_EXPORT(phy_search, search phy use MDIO);

static void phy_dump(int addr)
{
    int i;
    int value;

    rt_kprintf("dump phy addr %d\n", addr);

    for(i=0; i<32; i++)
    {
        value = ETH_ReadPHYRegister(addr, i);
        rt_kprintf("reg %02d: %04X\n", i, value);
    }
}
FINSH_FUNCTION_EXPORT(phy_dump, dump PHY register);

static void phy_write(int addr, int reg, int value)
{
    ETH_WritePHYRegister(addr, reg ,value);
}
FINSH_FUNCTION_EXPORT(phy_write, write PHY register);

static void emac_dump(int addr)
{
    int i;
    int value;
    int *p = (int *)ETH;

    rt_kprintf("dump EAMC reg %d\n", addr);

    for(i=0; i<sizeof(ETH_TypeDef)/4; i++)
    {
        value = *p++;
        rt_kprintf("reg %04X: %08X\n", i*4, value);
    }
}
FINSH_FUNCTION_EXPORT(emac_dump, dump EMAC register);

#endif // RT_USING_FINSH
#endif
